<?php
declare(strict_types=1);

namespace Yakoffka\AiracCalc\Tests\Unit;

use Yakoffka\AiracCalc\Tests\TestCase;

/**
 * Тестирование получения и показа дат вступления в силу циклов AIRAC:
 * методы AiracCalc::getEffectiveDates() и AiracCalc::showEffectiveDates()
 */
class GetEffectiveDatesTest extends TestCase
{
    private const SHOWED_DATES_20160107_20210107 = '
          2016 year
        1601 2016-01-07
        1602 2016-02-04
        1603 2016-03-03
        1604 2016-03-31
        1605 2016-04-28
        1606 2016-05-26
        1607 2016-06-23
        1608 2016-07-21
        1609 2016-08-18
        1610 2016-09-15
        1611 2016-10-13
        1612 2016-11-10
        1613 2016-12-08
        
          2017 year
        1701 2017-01-05
        1702 2017-02-02
        1703 2017-03-02
        1704 2017-03-30
        1705 2017-04-27
        1706 2017-05-25
        1707 2017-06-22
        1708 2017-07-20
        1709 2017-08-17
        1710 2017-09-14
        1711 2017-10-12
        1712 2017-11-09
        1713 2017-12-07
        
          2018 year
        1801 2018-01-04
        1802 2018-02-01
        1803 2018-03-01
        1804 2018-03-29
        1805 2018-04-26
        1806 2018-05-24
        1807 2018-06-21
        1808 2018-07-19
        1809 2018-08-16
        1810 2018-09-13
        1811 2018-10-11
        1812 2018-11-08
        1813 2018-12-06
        
          2019 year
        1901 2019-01-03
        1902 2019-01-31
        1903 2019-02-28
        1904 2019-03-28
        1905 2019-04-25
        1906 2019-05-23
        1907 2019-06-20
        1908 2019-07-18
        1909 2019-08-15
        1910 2019-09-12
        1911 2019-10-10
        1912 2019-11-07
        1913 2019-12-05
        
          2020 year
        2001 2020-01-02
        2002 2020-01-30
        2003 2020-02-27
        2004 2020-03-26
        2005 2020-04-23
        2006 2020-05-21
        2007 2020-06-18
        2008 2020-07-16
        2009 2020-08-13
        2010 2020-09-10
        2011 2020-10-08
        2012 2020-11-05
        2013 2020-12-03
        2014 2020-12-31
        ';

    /**
     * Проверка количества элементов в полученной коллекции на ограниченном интервале времени (5 лет)
     *      полученная коллекция должна состоять из 5 вложенных коллекций;
     *      каждая вложенная коллекция (кроме последней) должна содержать 13 циклов
     *      последняя вложенная коллекция должна содержать 14 циклов (2020 - високосный год AIRAC)
     *
     * @test
     */
    public function get_effective_dates_count(): void
    {
        $effectiveDates = $this->service->getEffectiveDates('2016-01-07', '2021-01-07');

        $dates = $effectiveDates->toArray();

        $this->assertCount(5, $effectiveDates);
        $this->assertCount(13, $dates['2016']);
        $this->assertCount(13, $dates['2017']);
        $this->assertCount(13, $dates['2018']);
        $this->assertCount(13, $dates['2019']);
        $this->assertCount(14, $dates['2020']); // 2020 - високосный год AIRAC
    }

    /**
     * Проверка показа дат вступления в силу циклов AIRAC на ограниченном интервале времени (5 лет)
     *
     * @test
     */
    public function show_effective_dates(): void
    {
        // $this->service->showEffectiveDates('2016-01-07', '2021-01-07');
        // $this->service->showEffectiveDates('2016-01-07', '2024-12-31');
        // $this->service->showEffectiveDates('2020-01-01', '2020-12-31');
        // dd($this->service->getEffectiveDates('2099-01-01', '2099-12-31'));

        ob_start();
        $this->service->showEffectiveDates('2016-01-07', '2021-01-07');
        $out1 = ob_get_clean();

        $this->assertSame($this::SHOWED_DATES_20160107_20210107, $out1);
    }
}